---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExportLineweightTable
source: html/2669cba1-8d8b-4e38-ccef-d54f7b3666b0.htm
---
# ExportLineweightTable Methods

Inserts a (key, info) pair into Export line weight table.